org/20221017224408-scan.org
:PROPERTIES:
:ID:       a357830b-4d5b-44b3-a4bf-827199061676
:END:
#+title: Scan

It is actually quite simple, a =Scan= =Op= contains an inner graph and a lot of the inner logic of the =Op= is to write the inputs/outputs of the inner and outer graphs. The =tap= functionality adds a little complexity, because of storage management.

* Outer inputs
* Inner inputs
* Inner outputs
* Outer outputs
