20221017224408-scan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-01 Mon 16:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Scan</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Scan</h1>
<p>
It is actually quite simple, a <code>Scan</code> <code>Op</code> contains an inner graph and a lot of the inner logic of the <code>Op</code> is to write the inputs/outputs of the inner and outer graphs. The <code>tap</code> functionality adds a little complexity, because of storage management.
</p>

<div id="outline-container-orgcaef0d0" class="outline-2">
<h2 id="orgcaef0d0">Outer inputs</h2>
</div>
<div id="outline-container-orgaf19e32" class="outline-2">
<h2 id="orgaf19e32">Inner inputs</h2>
</div>
<div id="outline-container-org96707bf" class="outline-2">
<h2 id="org96707bf">Inner outputs</h2>
</div>
<div id="outline-container-org18bee26" class="outline-2">
<h2 id="org18bee26">Outer outputs</h2>
</div>

<div id="outline-container-orge38c3a3" class="outline-2">
<h2 id="orge38c3a3">Links to this note</h2>
</div>
</div>
</body>
</html>
